
Archived entries from file /Users/tonyday/.emacs.d/dotemacs.org


** TODO dovecot execution choices
:PROPERTIES:
:ID:       C94AFA9F-AB07-4CFE-9DCE-A16F1805D315
:ARCHIVE_TIME: 2012-12-16 Sun 23:06
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/gnus/gnus r&d/gnus dev status
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: TODO
:END:

- [ ] what is (nnimap-shell-program "/usr/local/opt/dovecot/libexec/dovecot/imap")
/usr/local/Cellar/dovecot/2.1.10/libexec/dovecot/imap
http://wiki2.dovecot.org/LaunchdInstall

#+begin_src sh
            ps auxw|grep "dovecot"

#+end_src

#+results:
| root    |    95 | 0.0 | 0.0 | 2433616 |   4 | ?? | S  | 8:37PM | 0:00.01 | dovecot/config          |         |
| root    |    91 | 0.0 | 0.0 | 2433284 |   4 | ?? | S  | 8:37PM | 0:00.00 | dovecot/log             |         |
| tonyday |    90 | 0.0 | 0.0 | 2433284 |   4 | ?? | S  | 8:37PM | 0:00.00 | dovecot/anvil           |         |
| root    |    71 | 0.0 | 0.0 | 2433328 |   4 | ?? | Ss | 8:37PM | 0:00.02 | /usr/local/sbin/dovecot | -F      |
| tonyday | 15142 | 0.0 | 0.0 | 2423540 | 180 | ?? | R  | 2:35PM | 0:00.00 | grep                    | dovecot |

ps auxw|grep "dovecot"
http://wiki.dovecot.org/TestInstallation

auth default {
..
  passdb passwd-file {
    args = /etc/passwd.dovecot
  }
protocols = imap
mail_location = maildir:~/Mail
auth default {
  passdb passwd-file {
    args = /etc/passwd.dovecot
  }
}



- [ ] (setq imap-shell-program
       (quote
        ("/opt/local/sbin/dovecot --exec-mail imap" 
         "ssh %s imapd"
         "rsh %s imapd"
         "ssh %g ssh %s imapd"
         "rsh %g rsh %s imapd")))
- [ ] (setq imap-shell-program "dovecot -c ~/.dovecotrc --exec-mail imap")
- [ ] '(offlineimap-command "offlineimap -u machineui")

*** NEXT gnus dev status
SCHEDULED: <2012-12-14 Fri>
:LOGBOOK:
CLOCK: [2012-12-16 Sun 09:35]--[2012-12-17 Mon 06:42] => 21:07
CLOCK: [2012-12-14 Fri 13:46]--[2012-12-15 Sat 18:32] => 28:46
:END:
:PROPERTIES:
:ID:       6069F551-22F4-4F47-B33E-CE9A07A70C32
:END:

refs
http://www.sanityinc.com/articles/read-mailing-lists-in-emacs-over-imap
http://stackoverflow.com/questions/9977182/how-to-integrate-dovecot-version-2-with-gnus-emacs

(gnus-refer-article-method

status
- offlineimap working from the terminal and start-offlineimap-regular, but not
  on the launchctl platform.  The problem might be due to an inability to
  pass gmail the passord(?)
    - [X] problem with getting password to gmail???
    - [X] check rc
- [X] lay in solid primary select method
- [X] scrape back old secondaries
- [X] add in scarce
  dovecot offlineimap setup needed
- [X] add newsreadings (and review setup)
- [X] smtp needs/changes
    - [X] immediately mail send might be ok


**** dev tools

What dovecot processes are running
#+begin_src sh
  ps auxw|grep "dovecot"
#+end_src

#+results:
| tonyday | 416 | 0.0 | 0.0 | 2433512 | 1048 | ?? | S  | 11:02PM | 0:00.00 | dovecot/auth            |         |
| root    |  81 | 0.0 | 0.0 | 2433284 |  880 | ?? | S  | 11:02PM | 0:00.00 | dovecot/log             |         |
| tonyday |  80 | 0.0 | 0.0 | 2433284 |  804 | ?? | S  | 11:02PM | 0:00.00 | dovecot/anvil           |         |
| root    |  71 | 0.0 | 0.0 | 2433328 |  988 | ?? | Ss | 11:02PM | 0:00.02 | /usr/local/sbin/dovecot | -F      |
| tonyday | 489 | 0.0 | 0.0 | 2424992 |  464 | ?? | R  | 11:05PM | 0:00.00 | grep                    | dovecot |

#+begin_src sh
  ps auxw|grep "offlineimap"
#+end_src

#+results:
| tonyday | 409 | 0.1 | 0.1 | 2504792 | 14876 | s001 | Ss+ | 11:02PM | 0:00.89 | /usr/local/Cellar/python/2.7.3/Frameworks/Python.framework/Versions/2.7/Resources/Python.app/Contents/MacOS/Python | /usr/local/bin/offlineimap |
| tonyday | 492 | 0.0 | 0.0 | 2424992 |   464 | ??   | R   | 11:05PM | 0:00.00 | grep                                                                                                               | offlineimap                |



*** secondaries
:PROPERTIES:
:tangle:   no
:END:
 #+begin_src emacs-lisp
(setq gnus-secondary-select-methods
   (quote
    ((nntp "GigaNews"
           (nntp-address "text.giganews.com")
           (nntp-authinfo-user "dabrahams"))
     (nntp "Gmane"
           (nntp-address "news.gmane.org"))
     (nnimap "GMail"
             (nnimap-address "imap.gmail.com")
             (nnimap-server-port 993)
             (nnimap-stream ssl)
             (nnimap-user "dave.abrahams@gmail.com"))
     (nntp "Gwene"
           (nntp-address "news.gwene.org")))))
 
#+end_src

 #+results:
 | nnimap | tonyday567 | (nnimap-address imap.gmail.com) |
 | nnml   |            |                                 |




*** various select method attempts and patterns
:PROPERTIES:
:tangle:   no
:END:

#+begin_src emacs-lisp
(setq gnus-select-method
   (quote
    (nnimap "LocalIMAP"
            (nnimap-address "localhost")
            (nnimap-user "tonyday")
            (nnimap-stream network))))
#+end_src


#+begin_src emacs-lisp
(setq imap-shell-method "/usr/local/sbin/dovecot")
(setq gnus-secondary-select-methods '((nnimap "mail" (nnimap-stream shell))))
(setq gnus-secondary-select-methods '((nnimap "localhost" (nnimap-stream network))))
(setq gnus-select-method (quote
  (nnimap "localhost" 
    (nnimap-stream network))))

'(gnus-secondary-select-methods (quote ((nnimap "scarce" (nnimap-address "imap.gmail.com") (nnimap-server-port 993) (nnimap-stream ssl) (nnimap-user "tony.day@scarcecapital.com")) (nntp "giganews" (nntp-address "text.giganews.com") (nntp-authinfo-user "tonyday567")) (nntp "gmane" (nntp-address "news.gmane.org")) (nntp "Gwene" (nntp-address "news.gwene.org")))))

(setq gnus-select-method '(nnimap "Local" (nnimap-stream shell)))


(setq gnus-select-method
  (quote
   (nnimap "localhost"
           (nnimap-stream shell)
           (nnimap-shell-program "/usr/local/sbin/dovecot"))))

#+end_src

#+results:
| nnimap | Local | (nnimap-stream shell) | (nnimap-shell-program /usr/local/sbin/dovecot/libexec/dovecot/imap) |




** DONE slow packages
CLOSED: [2012-12-28 Fri 23:57]
:LOGBOOK:
- State "DONE"       from "NEXT"       [2012-12-28 Fri 23:57]
CLOCK: [2012-12-28 Fri 20:29]--[2012-12-28 Fri 23:50] =>  3:21
:END:
:PROPERTIES:
:ARCHIVE_TIME: 2013-03-09 Sat 16:02
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: clipboard/debugs and tools/current startup bugz and readings
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: DONE
:END:
Configuring package gnus...done (1.473s)
Loading package bbdb-gnus...done (0.905s)
Loading package org-magit...done (0.996s)
Configuring package erc...done (0.419s)
Loading package erc-yank...done (0.374s)
Loading /Users/tonyday/.emacs.d/dotemacs.el...done (10.830s) [after-init]

** NEXT tex development
:LOGBOOK:
CLOCK: [2013-02-24 Sun 21:13]--[2013-02-25 Mon 16:57] => 19:44
:END:
:PROPERTIES:
:tangle:   no
:ARCHIVE_TIME: 2013-03-16 Sat 13:39
:ARCHIVE_FILE: ~/.emacs.d/dotemacs.org
:ARCHIVE_OLPATH: packages/auctex
:ARCHIVE_CATEGORY: dotemacs
:ARCHIVE_TODO: NEXT
:END:
Some random old-school instructions

- best config
  - auctex-autoloads???
  - tex-site???
  - fix bug
  - reload helm


#+begin_src emacs-lisp
  (load "auctex.el" nil t t)
  (load "preview-latex.el" nil t t)
#+end_src

This gives you latex-mode
#+begin_src emacs-lisp
 (use-package latex)
  (use-package preview)
(use-package auctex-autoloads)
(use-package url)
#+end_src

